import langid

lang_codes = {
    "af": "南非荷兰语", "am": "阿姆哈拉语", "an": "阿拉贡语", "ar": "阿拉伯语", "as": "阿萨姆语", 
    "az": "阿塞拜疆语", "be": "白俄罗斯语", "bg": "保加利亚语", "bn": "孟加拉语", "br": "布列塔尼语", 
    "bs": "波斯尼亚语", "ca": "加泰罗尼亚语", "cs": "捷克语", "cy": "威尔士语", "da": "丹麦语", 
    "de": "德语", "dz": "不丹语", "el": "希腊语", "en": "英语", "eo": "世界语", 
    "es": "西班牙语", "et": "爱沙尼亚语", "eu": "巴斯克语", "fa": "波斯语", "fi": "芬兰语", 
    "fo": "法罗语", "fr": "法语", "ga": "爱尔兰语", "gl": "加利西亚语", "gu": "古吉拉特语", 
    "he": "希伯来语", "hi": "印地语", "hr": "克罗地亚语", "ht": "海地克里奥尔语", "hu": "匈牙利语", 
    "hy": "亚美尼亚语", "id": "印度尼西亚语", "is": "冰岛语", "it": "意大利语", "ja": "日语", 
    "jv": "爪哇语", "ka": "格鲁吉亚语", "kk": "哈萨克语", "km": "高棉语", "kn": "卡纳达语", 
    "ko": "韩语", "ku": "库尔德语", "ky": "吉尔吉斯语", "la": "拉丁语", "lb": "卢森堡语", 
    "lo": "老挝语", "lt": "立陶宛语", "lv": "拉脱维亚语", "mg": "马尔加什语", "mk": "马其顿语", 
    "ml": "马拉雅拉姆语", "mn": "蒙古语", "mr": "马拉地语", "ms": "马来语", "mt": "马耳他语", 
    "nb": "挪威博克马尔语", "ne": "尼泊尔语", "nl": "荷兰语", "nn": "挪威尼诺斯克语", "no": "挪威语", 
    "oc": "奥克西唐语", "or": "奥里亚语", "pa": "旁遮普语", "pl": "波兰语", "ps": "普什图语", 
    "pt": "葡萄牙语", "qu": "克丘亚语", "ro": "罗马尼亚语", "ru": "俄语", "rw": "卢旺达语", 
    "se": "北萨米语", "si": "僧伽罗语", "sk": "斯洛伐克语", "sl": "斯洛文尼亚语", "sq": "阿尔巴尼亚语", 
    "sr": "塞尔维亚语", "sv": "瑞典语", "sw": "斯瓦希里语", "ta": "泰米尔语", "te": "泰卢固语", 
    "th": "泰语", "tl": "塔加洛语", "tr": "土耳其语", "ug": "维吾尔语", "uk": "乌克兰语", 
    "ur": "乌尔都语", "vi": "越南语", "vo": "沃拉普克语", "wa": "瓦隆语", "xh": "科萨语", 
    "zh": "中文", "zu": "祖鲁语"
}


def detect_language(text):
    lang, _ = langid.classify(text)
    return lang_codes[lang]